print("""
         (()__(()
        /       \ 
       ( /    \  \ 
        \ o o    /
        (_()_)__/ \ 
       / _,==.____ \ 
      (   |--|      )
      /\_.|__|'-.__/\_
     / (        /     \ 
     \  \      (      /
      )  '._____)    /
   (((____.--(((____/

      """)


print("""
    .....  .........    ..........  .        .
    .          .             .      .        .
    .          .             .      .        .
    .....      .             .      .        .
        .      .         ..  .      .        .
        .      .         ..  .      .        . 
    .....      .          ...       ..........



    """)

print("|*       |\n|    *   |\n| *      |\n|     *  |\n|  *     |\n|      * |\n|   *    |\n|       *|\n")

print("""
                             忆江南
                    作者：白居易 年代：唐
江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？ 　　
江南忆，最忆是杭州。山寺月中寻桂子，郡亭枕上看潮头。何日更重游？ 　　
江南忆，其次忆吴宫。吴酒一杯春竹叶，吴娃双舞醉芙蓉。早晚复相逢？

    """)

a = 3
b = 4
c = 6
cosA = (b**2+c**2-a**2)/(2*b*c)
s1 = 0.5*b*c*((1-cosA**2)**0.5)
print(s1)
print("\n")

x1,y1=0.1,0.1
x2,y2=0.3,0.3
x3,y3=0.4,0.5

a = ((x1-x2)**2+(y1-y2)**2)**0.5
b = ((x3-x2)**2+(y3-y2)**2)**0.5
c = ((x1-x3)**2+(y1-y3)**2)**0.5
cosA = (b**2+c**2-a**2)/(2*b*c)
s2 = 0.5*b*c*((1-cosA**2)**0.5)
print(s2)
print("\n")

a = 1
b = 2
c = -1
if b**2-4*a*c>=0:
    if a==0:
        ans1,ans2 = -c/b,-c/b
    else:
        ans1 = (-b+(b**2-4*a*c)**0.5)/(2*a)
        ans2 = (-b-(b**2-4*a*c)**0.5)/(2*a)

print(ans1,ans2)
print("\n")

a = int(input("a=?"))
b = int(input("b=?"))
c = int(input("c=?"))
x = -b/(2*a)
M = a*x**2+b*x+c
print(M)

